tutorials/compressible/sonicFoam/shockTube/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets      
(
    data
    {
        type            uniform;

        axis            x;
        start           (-4.995 0 0);
        end             (4.995  0 0);
        nPoints         1000;
    }
);

surfaces
();

fields          
(
    T
    magU
    p
);

// ************************************************************************* //
